Conf.Simple/src/InformationRegisters/SUI_СообщенияМобильныхУстройств/SUI_СообщенияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияМобильныхУстройств</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/CommonModules/SUI_СообщенияМобильныхУстройств/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОтправитьСообщение(Получатель, Сообщение) Экспорт
	Возврат РегистрыСведений.SUI_СообщенияМобильныхУстройств.СоздатьСообщение(
		ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(), Получатель, Сообщение);
КонецФункции

Функция ОтправитьСообщениеГлавномуУзлу(Отправитель, Сообщение) Экспорт
	Возврат РегистрыСведений.SUI_СообщенияМобильныхУстройств.СоздатьСообщение(Отправитель,
		ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(), Сообщение);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОчисткуСообщений() Экспорт

	ДниХранения = ПолучитьФункциональнуюОпцию("SUI_ХранениеСообщенийМобильныхУстройствВДнях");
	
	Если Не ЗначениеЗаполнено(ДниХранения) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаЗаписей", ТекущаяДатаСеанса() - 86400 * ДниХранения);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_СообщенияМобильныхУстройств.ID КАК ID,
		|	SUI_СообщенияМобильныхУстройств.Отправитель КАК Отправитель,
		|	SUI_СообщенияМобильныхУстройств.Получатель КАК Получатель
		|ИЗ
		|	РегистрСведений.SUI_СообщенияМобильныхУстройств КАК SUI_СообщенияМобильныхУстройств
		|ГДЕ
		|	SUI_СообщенияМобильныхУстройств.ДатаЗаписи < &ДатаНачалаЗаписей
		|
		|УПОРЯДОЧИТЬ ПО
		|	SUI_СообщенияМобильныхУстройств.МеткаВремени";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияМобильныхУстройств");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Отправитель", "Отправитель");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Получатель", "Получатель");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл
			
				НаборЗаписей = РегистрыСведений.SUI_СообщенияМобильныхУстройств.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.ID.Установить(Выборка.ID);
				НаборЗаписей.Отбор.Отправитель.Установить(Выборка.Отправитель);
				НаборЗаписей.Отбор.Получатель.Установить(Выборка.Получатель);
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				
				НаборЗаписей.Записать(Истина);
			
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
				SUI_МобильныеУстройстваКлиентСервер.ИмяСобытия(НСтр("ru = 'Сообщения мобильных устройств'")), ,
				Метаданные.ОбщиеМодули.SUI_СообщенияМобильныхУстройств, , ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
